In [3]:
%load_ext sql

In [5]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [6]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 12, 2, 36, 57, 796000), '53', 'free', None, None, 438, None, None),
 (2, datetime.datetime(2018, 11, 12, 2, 37, 38, 796000), '10', 'free', None, None, 345, None, None),
 (3, datetime.datetime(2018, 11, 12, 2, 37, 44, 796000), '53', 'free', None, None, 438, None, None),
 (4, datetime.datetime(2018, 11, 12, 2, 42, 21, 796000), '53', 'free', None, None, 438, None, None),
 (5, datetime.datetime(2018, 11, 12, 2, 45, 14, 796000), '29', 'paid', None, None, 389, None, None)]

In [7]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('53', 'Celeste', 'Williams', 'F', 'free'),
 ('10', 'Sylvie', 'Cruz', 'F', 'free'),
 ('29', 'Jacqueline', 'Lynch', 'F', 'paid'),
 ('68', 'Jordan', 'Rodriguez', 'F', 'free'),
 ('47', 'Kimber', 'Norris', 'F', 'free')]

In [8]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOPEGZN12AB0181B3D', 'Get Your Head Stuck On Your Neck', 'AREDL271187FB40F44', 0, Decimal('45.66159')),
 ('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', 0, Decimal('29.54404')),
 ('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', 0, Decimal('153.33832')),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, Decimal('338.23302')),
 ('SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', 1994, Decimal('236.17261'))]

In [9]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOPEGZN12AB0181B3D', 'Get Your Head Stuck On Your Neck', 'AREDL271187FB40F44', Decimal('0'), Decimal('45.66159')),
 ('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', Decimal('0'), Decimal('29.54404')),
 ('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', Decimal('0'), Decimal('153.33832')),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', Decimal('0'), Decimal('338.23302')),
 ('SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', Decimal('1994'), Decimal('236.17261'))]

In [10]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 12, 2, 37, 38, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 37, 44, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 42, 21, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 45, 52, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 47, 22, 796000), 2, 12, 46, 11, 2018, 0)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).